# clothing_yolos — TensorRT FP16 clothing detector (dynamic HxW 224..512..800).
name: "clothing_yolos_trt"
platform: "tensorrt_plan"
max_batch_size: 0
input [ { name: "pixel_values" data_type: TYPE_FP32 dims: [ 1, 3, 512, 512 ] } ]
output [
  { name: "logits" data_type: TYPE_FP32 dims: [ 1, -1, 47 ] },
  { name: "pred_boxes" data_type: TYPE_FP32 dims: [ 1, -1, 4 ] }
]
instance_group [ { count: 1 kind: KIND_GPU } ]
