# yolo26 — TensorRT FP16 engine (built from 1/model.onnx via trtexec --fp16).
# ~2x faster than the ONNX path at the same accuracy. The .plan is GPU/TRT-version
# specific and gitignored — rebuild on the target box.
name: "yolo26_trt"
platform: "tensorrt_plan"
max_batch_size: 0
input [
  { name: "images" data_type: TYPE_FP32 dims: [ 1, 3, 640, 640 ] }
]
output [
  { name: "output0" data_type: TYPE_FP32 dims: [ 1, 300, 6 ] }
]
instance_group [ { count: 1 kind: KIND_GPU } ]
