# antispoofing — TensorRT FP16 liveness engine.
name: "antispoofing_trt"
platform: "tensorrt_plan"
max_batch_size: 0
input [ { name: "input" data_type: TYPE_FP32 dims: [ 1, 3, 80, 80 ] } ]
output [ { name: "output" data_type: TYPE_FP32 dims: [ 1, 3 ] } ]
instance_group [ { count: 1 kind: KIND_GPU } ]
