# YOLO person/object detector for suspect-search (person + bag classes).
# Fixed 640x640 input, single fixed-batch output.
name: "yolo26"
platform: "onnxruntime_onnx"
max_batch_size: 0
input [
  { name: "images" data_type: TYPE_FP32 dims: [ 1, 3, 640, 640 ] }
]
output [
  { name: "output0" data_type: TYPE_FP32 dims: [ 1, 300, 6 ] }
]
instance_group [ { count: 1 kind: KIND_GPU } ]
