# ppocr_v6 — TensorRT FP16 OCR (dynamic width profile 80..320..640). Rebuild from onnx.
name: "ppocr_v6_trt"
platform: "tensorrt_plan"
max_batch_size: 0
input [ { name: "x" data_type: TYPE_FP32 dims: [ 1, 3, 48, -1 ] } ]
output [ { name: "fetch_name_0" data_type: TYPE_FP32 dims: [ 1, -1, 18710 ] } ]
instance_group [ { count: 1 kind: KIND_GPU } ]
