# ANPR plate detector (YOLO26s, single "plate" class). NMS baked in ->
# [1,300,6] (x1,y1,x2,y2,score,class). Fixed 640x640 input.
name: "anpr_plate"
platform: "onnxruntime_onnx"
max_batch_size: 0
input [
  { name: "images" data_type: TYPE_FP32 dims: [ 1, 3, 640, 640 ] }
]
output [
  { name: "output0" data_type: TYPE_FP32 dims: [ 1, 300, 6 ] }
]
instance_group [ { count: 2 kind: KIND_GPU } ]
