# person_reid — TensorRT FP16 ReID-embedding engine.
name: "person_reid_trt"
platform: "tensorrt_plan"
max_batch_size: 0
input [ { name: "input" data_type: TYPE_FP32 dims: [ 1, 3, 256, 128 ] } ]
output [ { name: "output" data_type: TYPE_FP32 dims: [ 1, 768, 1, 1 ] } ]
instance_group [ { count: 1 kind: KIND_GPU } ]
